app/Http/Controllers/AccountController.php

    static function permissionStr()
    {
        $permission_str = DB::table('permissions')->where('permission_num', self::permissionNum())->first()->permission_str;
---
select * from `permissions` where `permission_num` = 1 limit 1