app/Http/Controllers/BoardController.php

    public function show(Request $request, $id)
    {
        $project = DB::table('projects')
            ->join('contracts', 'contracts.contract_id', '=', 'projects.contract_id')
            ->join('customers', 'customers.customer_id', '=', 'contracts.customer_id')
            ->join('phases', 'phases.phase_id', '=', 'projects.phase_id')
            ->join('project_teams', 'project_teams.project_id', '=', 'projects.project_id')
            ->select(
                'project_teams.*',
                'projects.*',
                DB::raw("CONCAT(customers.company_name, ' - ', customers.last_name, ' ', customers.first_name) AS customer_info"),
                'phases.phase_name_eng'
            )
            ->orderBy('project_teams.project_id', 'asc')
            ->get();
        foreach ($project as $item) {
            $item->team_members = DB::table('team_details')
                ->join('employees', 'employees.employee_id', '=', 'team_details.employee_id')
                ->where('team_id', $item->team_id)
                ->orderBy('team_permission', 'asc')
                ->get();
---
select `project_teams`.*, `projects`.*, CONCAT(customers.company_name, ' - ', customers.last_name, ' ', customers.first_name) AS customer_info, `phases`.`phase_name_eng` from `projects` inner join `contracts` on `contracts`.`contract_id` = `projects`.`contract_id` inner join `customers` on `customers`.`customer_id` = `contracts`.`customer_id` inner join `phases` on `phases`.`phase_id` = `projects`.`phase_id` inner join `project_teams` on `project_teams`.`project_id` = `projects`.`project_id` order by `project_teams`.`project_id` asc
select * from `team_details` inner join `employees` on `employees`.`employee_id` = `team_details`.`employee_id` where `team_id` = 67 order by `team_permission` asc


            $item->all_employees = DB::select($sql);

            $item->locations = DB::table('project_locations')->where('project_id', $item->project_id)->get();
        }
        $teams = DB::table('teams')->get();
        $team_positions = DB::table("team_positions")->get();
        $contracts = DB::table('contracts')
            ->leftjoin('projects', 'contracts.contract_id', '=', 'projects.contract_id')
            ->whereNull('projects.contract_id')->select('contracts.contract_id', 'contracts.contract_name')->get();
---
select * from `project_locations` where `project_id` = 32
select * from `teams`
select * from `team_positions`
select `contracts`.`contract_id`, `contracts`.`contract_name` from `contracts` left join `projects` on `contracts`.`contract_id` = `projects`.`contract_id` where `projects`.`contract_id` is null



        if(!$id) $id = 1;
        $board = DB::table('boards')
            ->where('location_id', $id)
            ->first();

        if ($board) {
            $columns = DB::table('columns')
                ->where('board_id', $board->id)
                ->get();

            foreach ($columns as &$column) {
                $column->cards = DB::table('cards')
                    ->where('column_id', $column->id)
                    ->get();
---
select * from `boards` where `location_id` = '4' limit 1
select * from `columns` where `board_id` = 1
select * from `cards` where `column_id` = 1