app/Http/Controllers/CardsReorderUpdateController.php

insert into `cards` (`column_id`, `created_at`, `id`, `position`, `updated_at`) values (3, '2024-08-19 07:02:49', 5, 1000, '2024-08-19 07:02:49'), (2, '2024-08-19 07:02:49', 2, 1000, '2024-08-19 07:02:49'), (2, '2024-08-19 07:02:49', 3, 2000, '2024-08-19 07:02:49'), (2, '2024-08-19 07:02:49', 4, 3000, '2024-08-19 07:02:49'), (2, '2024-08-19 07:02:49', 6, 4000, '2024-08-19 07:02:49'), (2, '2024-08-19 07:02:49', 9, 5000, '2024-08-19 07:02:49'), (2, '2024-08-19 07:02:49', 10, 6000, '2024-08-19 07:02:49'), (3, '2024-08-19 07:02:49', 5, 1000, '2024-08-19 07:02:49'), (3, '2024-08-19 07:02:49', 6, 2000, '2024-08-19 07:02:49'), (2, '2024-08-19 07:02:49', 2, 1000, '2024-08-19 07:02:49'), (2, '2024-08-19 07:02:49', 3, 2000, '2024-08-19 07:02:49'), (2, '2024-08-19 07:02:49', 4, 3000, '2024-08-19 07:02:49'), (2, '2024-08-19 07:02:49', 9, 4000, '2024-08-19 07:02:49'), (2, '2024-08-19 07:02:49', 10, 5000, '2024-08-19 07:02:49'), (3, '2024-08-19 07:02:49', 5, 1000, '2024-08-19 07:02:49'), (3, '2024-08-19 07:02:49', 2, 2000, '2024-08-19 07:02:49'), (3, '2024-08-19 07:02:49', 6, 3000, '2024-08-19 07:02:49'), (2, '2024-08-19 07:02:49', 3, 1000, '2024-08-19 07:02:49'), (2, '2024-08-19 07:02:49', 4, 2000, '2024-08-19 07:02:49'), (2, '2024-08-19 07:02:49', 9, 3000, '2024-08-19 07:02:49'), (2, '2024-08-19 07:02:49', 10, 4000, '2024-08-19 07:02:49') on duplicate key update `position` = values(`position`), `column_id` = values(`column_id`), `updated_at` = values(`updated_at`)
---
    public function __invoke(CardsReorderUpdateRequest $request): RedirectResponse
    {
        $data = collect($request->columns)
            ->map(function ($column) {
                // Convert cards to a collection and map each card to the desired format
                return collect($column['cards'])->map(function ($card) use ($column) {
                    return [
                        'id' => $card['id'],
                        'position' => $card['position'],
                        'column_id' => $column['id']
                    ];
                });
            })
            // Flatten the array to get a single level of cards
            ->flatten(1)
            // Convert the collection to an array
            ->toArray();

// Perform the batch upsert
        Card::query()->upsert($data, ['id'], ['position', 'column_id']);