app/Http/Controllers/DashboardController.php

select * from `employees` where `fired` = 'false'
select * from `teams`
select * from `projects`
select count(*) as aggregate from `tasks` where `parent_id` is null
select count(*) as aggregate from `tasks` where not `parent_id` is null
---
    public function getViewDashboard()
    {
        $account_id = \Illuminate\Support\Facades\Request::session()->get(\App\StaticString::ACCOUNT_ID);
        $sql_get_employee_id = "SELECT * FROM employees, accounts WHERE employees.employee_id = accounts.employee_id AND account_id = $account_id";
        $employee_id = DB::selectOne($sql_get_employee_id)->employee_id;

        $em_c = count(DB::table('employees')->where('fired','false')->get());
        $team_c = count(TeamModel::all());
        $project_c = count(ProjectModel::all());

        $task_c = DB::table('tasks')->where('parent_id',null)->count();
        $sub_c = DB::table('tasks')->whereNot('parent_id',null)->count();

select count(*) as aggregate from `departments`
---
        $subtasks = DB::select($subtask_sql);


        $department_c = DB::table('departments')->count();