app/Http/Controllers/LoginController.php

    public function postLogin(Request $request)
    {
        $sql = "SELECT * FROM accounts WHERE username = '$request->username' or email = '$request->username' LIMIT 1";
        $account = DB::select($sql);
        if (!$account) {
            DB::table('login_history')->insert(['status'=>0,'desc'=>'fail', 'username'=>$request->username, 'ip'=>\Illuminate\Support\Facades\Request::session()->get(\App\StaticString::POSITION)]);
            return redirect()
                ->action('App\Http\Controllers\LoginController@postLogin')
                ->with('msg', 'Username or password is incorrect');
        }

        if($account[0]->status===3){
            return redirect()
                ->action('App\Http\Controllers\LoginController@postLogin')
                ->with('msg', 'Account is locked');
        }

        if (password_verify($request->password, $account[0]->password)) {
            $request->session()->put(StaticString::SESSION_ISLOGIN, true);
            $request->session()->put(StaticString::PERMISSION, $account[0]->permission);
            $request->session()->put(StaticString::ACCOUNT_ID, $account[0]->account_id);
            DB::table('login_history')->insert(['status'=>1,'desc'=>'success', 'username'=>$request->username, 'ip'=>\Illuminate\Support\Facades\Request::session()->get(\App\StaticString::POSITION)]);
---
insert into `login_history` (`status`, `desc`, `username`, `ip`) values (1, 'success', 'super', '113.161.197.197')