app/Http/Controllers/TeamDetailsController.php

    static function getPermissionName($permission)
    {
        return DB::table("team_positions")->where('team_permission', $permission)->value('position_name');
---
select `position_name` from `team_positions` where `team_permission` = 1 limit 1